Autodesk.Revit.DB.Ellipse.CreateCurve(Autodesk.Revit.DB.XYZ,System.Double,System.Double,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double,System.Double)
Creates a new geometric ellipse or elliptical arc object.
Remarks:
If the angle range is equal to or greater than 2 * PI, the curve will be
automatically converted to an unbounded ellipse.
If xRadius and yRadius are almost equal, the curve will be
returned as an arc.
center:
The center.
xRadius:
The x vector radius of the ellipse.
yRadius:
The y vector radius of the ellipse.
xAxis:
The x axis to define the ellipse plane.  Must be normalized.
yAxis:
The y axis to define the ellipse plane.   Must be normalized.
startParameter:
The raw parameter value at the start of the ellipse.
endParameter:
The raw parameter value at the end of the ellipse.
Returns:
The new ellipse or elliptical arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for xRadius must be greater than 0 and no more than 30000 feet.
-or-
The given value for yRadius must be greater than 0 and no more than 30000 feet.
-or-
xAxis is not length 1.0.
-or-
yAxis is not length 1.0.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors xAxis and yAxis are not perpendicular.
-or-
Start parameter must be less than end parameter.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2017_subscription_update

Autodesk.Revit.DB.Ellipse.RadiusY
Returns the Y vector radius of the ellipse.

Autodesk.Revit.DB.Ellipse.RadiusX
Returns the X vector radius of the ellipse.

Autodesk.Revit.DB.Ellipse.YDirection
The Y direction.
Since: 2013

Autodesk.Revit.DB.Ellipse.XDirection
The X direction.
Since: 2013

Autodesk.Revit.DB.Ellipse.Normal
Returns the normal to the plane in which the ellipse is defined.

Autodesk.Revit.DB.Ellipse.Center
Returns the center of the ellipse.

Autodesk.Revit.DB.Ellipse
A whole or partial ellipse.